{"keras_version": "2.2.4", "class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false}}, {"name": "Conv1_pad", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "Conv1_pad", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "Conv1", "inbound_nodes": [[["Conv1_pad", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "valid", "trainable": true, "strides": [2, 2], "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "Conv1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "bn_Conv1", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "bn_Conv1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "Conv1_relu", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "Conv1_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "expanded_conv_depthwise", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "expanded_conv_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "expanded_conv_depthwise_BN", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "expanded_conv_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "expanded_conv_depthwise_relu", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "expanded_conv_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 16, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "expanded_conv_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "expanded_conv_project_BN", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "expanded_conv_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_1_expand", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 96, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_1_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_1_expand_BN", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_1_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_1_expand_relu", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_1_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_1_pad", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "block_1_pad", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "block_1_depthwise", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_1_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_1_depthwise_BN", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_1_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_1_depthwise_relu", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_1_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_1_project", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 24, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_1_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_1_project_BN", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_1_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_2_expand", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 144, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_2_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_2_expand_BN", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_2_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_2_expand_relu", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_2_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_2_depthwise", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_2_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_2_depthwise_BN", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_2_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_2_depthwise_relu", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_2_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_2_project", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 24, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_2_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_2_project_BN", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_2_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_2_add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_2_add", "trainable": true}}, {"name": "block_3_expand", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 144, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_3_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_3_expand_BN", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_3_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_3_expand_relu", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_3_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_3_pad", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "block_3_pad", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "block_3_depthwise", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_3_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_3_depthwise_BN", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_3_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_3_depthwise_relu", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_3_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_3_project", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_3_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_3_project_BN", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_3_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_4_expand", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 192, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_4_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_4_expand_BN", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_4_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_4_expand_relu", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_4_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_4_depthwise", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_4_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_4_depthwise_BN", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_4_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_4_depthwise_relu", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_4_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_4_project", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_4_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_4_project_BN", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_4_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_4_add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_4_add", "trainable": true}}, {"name": "block_5_expand", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 192, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_5_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_5_expand_BN", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_5_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_5_expand_relu", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_5_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_5_depthwise", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_5_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_5_depthwise_BN", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_5_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_5_depthwise_relu", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_5_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_5_project", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 32, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_5_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_5_project_BN", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_5_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_5_add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_5_add", "trainable": true}}, {"name": "block_6_expand", "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 192, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_6_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_6_expand_BN", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_6_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_6_expand_relu", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_6_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_6_pad", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "class_name": "ZeroPadding2D", "config": {"name": "block_6_pad", "data_format": "channels_last", "padding": [[0, 1], [0, 1]], "trainable": true}}, {"name": "block_6_depthwise", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "valid", "dilation_rate": [1, 1], "trainable": true, "strides": [2, 2], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_6_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_6_depthwise_BN", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_6_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_6_depthwise_relu", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_6_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_6_project", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_6_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_6_project_BN", "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_6_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_7_expand", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 384, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_7_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_7_expand_BN", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_7_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_7_expand_relu", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_7_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_7_depthwise", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_7_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_7_depthwise_BN", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_7_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_7_depthwise_relu", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_7_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_7_project", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_7_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_7_project_BN", "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_7_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_7_add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_7_add", "trainable": true}}, {"name": "block_8_expand", "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 384, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_8_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_8_expand_BN", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_8_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_8_expand_relu", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_8_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_8_depthwise", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_8_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_8_depthwise_BN", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_8_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_8_depthwise_relu", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_8_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_8_project", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_8_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_8_project_BN", "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_8_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_8_add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_8_add", "trainable": true}}, {"name": "block_9_expand", "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 384, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_9_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_9_expand_BN", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_9_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_9_expand_relu", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_9_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_9_depthwise", "inbound_nodes": [[["block_9_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_9_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_9_depthwise_BN", "inbound_nodes": [[["block_9_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_9_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_9_depthwise_relu", "inbound_nodes": [[["block_9_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_9_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_9_project", "inbound_nodes": [[["block_9_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 64, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_9_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_9_project_BN", "inbound_nodes": [[["block_9_project", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_9_project_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_9_add", "inbound_nodes": [[["block_8_add", 0, 0, {}], ["block_9_project_BN", 0, 0, {}]]], "class_name": "Add", "config": {"name": "block_9_add", "trainable": true}}, {"name": "block_10_expand", "inbound_nodes": [[["block_9_add", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 384, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_10_expand", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "bias_regularizer": null, "kernel_constraint": null}}, {"name": "block_10_expand_BN", "inbound_nodes": [[["block_10_expand", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_10_expand_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_10_expand_relu", "inbound_nodes": [[["block_10_expand_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_10_expand_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_10_depthwise", "inbound_nodes": [[["block_10_expand_relu", 0, 0, {}]]], "class_name": "DepthwiseConv2D", "config": {"data_format": "channels_last", "depthwise_constraint": null, "padding": "same", "dilation_rate": [1, 1], "trainable": true, "strides": [1, 1], "bias_regularizer": null, "depth_multiplier": 1, "use_bias": false, "kernel_size": [3, 3], "bias_constraint": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_10_depthwise", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "depthwise_regularizer": null}}, {"name": "block_10_depthwise_BN", "inbound_nodes": [[["block_10_depthwise", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "scale": true, "gamma_constraint": null, "name": "block_10_depthwise_BN", "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.999}}, {"name": "block_10_depthwise_relu", "inbound_nodes": [[["block_10_depthwise_BN", 0, 0, {}]]], "class_name": "ReLU", "config": {"name": "block_10_depthwise_relu", "max_value": 6.0, "negative_slope": 0.0, "trainable": true, "threshold": 0.0}}, {"name": "block_10_project", "inbound_nodes": [[["block_10_depthwise_relu", 0, 0, {}]]], "class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "trainable": true, "strides": [1, 1], "filters": 96, "activation": "linear", "dilation_rate": [1, 1], "kernel_size": [1, 1], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "name": "block_10_project", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, 